app/views/shopping_carts/index.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "ticket_zones".* FROM "ticket_zones" WHERE "ticket_zones"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          	<tr>
          		<td><%=TicketType.find(k).event.name%></td>
          		<td><%=TicketType.find(k).event.start_date.in_time_zone()%></td>
          		<td><%=TicketType.find(k).ticket_zone.zone%></td>
          		<td><%=TicketType.find(k).price%></td>