app/controllers/events_controller.rb

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "events" ("name", "description", "start_date", "event_venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "events" SET "updated_at" = ? WHERE "events"."id" = ?  [["updated_at", "2019-05-31 22:38:25.437432"], ["id", 4]]
---
  def create
    @event = Event.new(event_params)
    @event.event_venue = EventVenue.find(event_params[:event_venue_id])

    respond_to do |format|
      if @event.save