app/controllers/shopping_carts_controller.rb

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def add_ticket

    # Set the shopping cart if unset
    session[:shopping_cart] ||= []

    begin
      ticket_type = TicketType.find(shopping_cart_params[:ticket_type_id])